Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "cmsis_os.h"
#include "fatfs.h"

/* USER CODE BEGIN Includes */
// ToDo: Szemaforral indítani az egyes méréseket, ezzel tehermentesíteni a processzort.
#include "measure_config.h"
/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
osThreadId startMeasureTaskHandle;

#if defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME) || defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
osSemaphoreId measureSemaphoreA_xSemaphore = NULL;
osSemaphoreId measureSemaphoreB_xSemaphore = NULL;
osSemaphoreId measureSemaphoreC_xSemaphore = NULL;
#endif

#if defined(MEAS_TASK_SWITCHING_TIME)
osThreadId switchingTimeTaskAHandle;
osThreadId switchingTimeTaskBHandle;
osThreadId switchingTimeTaskCHandle;
#endif

#if defined(MEAS_PREEMPTION_TIME)
osThreadId preemptionTimeTaskAHandle;
osThreadId preemptionTimeTaskBHandle;
osThreadId preemptionTimeTaskCHandle;
#endif

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
osThreadId interruptLatencyTimeTaskHandle;
osSemaphoreId interruptLatency_xSemaphore = NULL;
#endif

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
osThreadId semaphoreShufflingTimeTaskAHandle;
osThreadId semaphoreShufflingTimeTaskBHandle;
osSemaphoreId semaphoreShuffling_xSemaphore = NULL;
#endif

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
osThreadId deadlockBreakingTimeTaskAHandle;
osThreadId deadlockBreakingTimeTaskBHandle;
osThreadId deadlockBreakingTimeTaskCHandle;
osMutexId deadlockBreaking_xMutex = NULL;
#endif

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
osThreadId datagramThroughputTimeTaskAHandle;
osThreadId datagramThroughputTimeTaskBHandle;
osSemaphoreId datagramThroughput_xSemaphore = NULL;
osMessageQId datagramThrougput_xMessage = NULL;
#endif

#if defined(BLINKING_LED)
osThreadId forwardLEDTaskHandle;
osThreadId reverseLEDTaskHandle;
#endif

#if defined(MEAS_W_LOAD)
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;

I2C_HandleTypeDef hi2c1;

SD_HandleTypeDef hsd;
HAL_SD_CardInfoTypedef SDCardInfo;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

osThreadId uart6TaskHandle;
osSemaphoreId uart6_xSemaphore = NULL;
#endif
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void Error_Handler(void);
static void MX_GPIO_Init(void);
#if defined(MEAS_W_LOAD)
static void MX_ADC1_Init(void);
static void MX_SDIO_SD_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_ADC2_Init(void);
static void MX_I2C1_Init(void);
static void MX_USART1_UART_Init(void);
#endif

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/
void StartStartMeasureTask(void const * argument);

#if defined(MEAS_TASK_SWITCHING_TIME)
void StartSwitchingTimeTaskA(void const * argument);
void StartSwitchingTimeTaskB(void const * argument);
void StartSwitchingTimeTaskC(void const * argument);
#endif

#if defined(MEAS_PREEMPTION_TIME)
void StartPreemptionTimeTaskA(void const * argument);
void StartPreemptionTimeTaskB(void const * argument);
void StartPreemptionTimeTaskC(void const * argument);
#endif

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
void StartInterruptLatencyTimeTask(void const * argument);
#endif

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
void StartSemaphoreShufflingTimeTaskA(void const * argument);
void StartSemaphoreShufflingTimeTaskB(void const * argument);
#endif

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
void StartDeadlockBreakingTimeTaskA(void const * argument);
void StartDeadlockBreakingTimeTaskB(void const * argument);
void StartDeadlockBreakingTimeTaskC(void const * argument);
#endif

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
void StartDatagramThroughputTimeTaskA(void const * argument);
void StartDatagramThroughputTimeTaskB(void const * argument);
#endif

#if defined(BLINKING_LED)
void StartForwardLEDTask(void const * argument);
void StartReverseLEDTask(void const * argument);
#endif

