Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
#if defined(MEAS_W_LOAD)
  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_5, GPIO_PIN_RESET);

  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_12|GPIO_PIN_13 
                          |GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_3
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7, GPIO_PIN_RESET);

  /*Configure GPIO pins : PE2 PE4 PE5 */
  GPIO_InitStruct.Pin = GPIO_PIN_2|GPIO_PIN_4|GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);

  /*Configure GPIO pin : PC13 */
  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : PB15 */
  GPIO_InitStruct.Pin = GPIO_PIN_15;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pins : PD8 PD9 PD12 PD13 
                           PD14 PD15 PD3
                           PD4 PD5 PD6 PD7 */
  GPIO_InitStruct.Pin = GPIO_PIN_8|GPIO_PIN_9|GPIO_PIN_12|GPIO_PIN_13 
                          |GPIO_PIN_14|GPIO_PIN_15|GPIO_PIN_3
                          |GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : PD10 PD11 */
  GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
#else
#if defined(MEAS_LATENCY) || defined(MEAS_INTERRUPT_LATENCY_TIME)
  /*Configure GPIO pin : PC13 */
  GPIO_InitStruct.Pin = GPIO_PIN_13;
  GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
#endif

  /*Configure GPIO pin Output Level */
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7, GPIO_PIN_RESET);

  /*Configure GPIO pins : PD3 PD4 PD5 PD6 PD7 */
    GPIO_InitStruct.Pin = GPIO_PIN_3|GPIO_PIN_4|GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

#if defined(BLINKING_LED)
  /*Configure GPIO pin Output Level */
  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15, GPIO_PIN_RESET);
  /*Configure GPIO pins :PD12 PD13 PD14 PD15*/
    GPIO_InitStruct.Pin = GPIO_PIN_12|GPIO_PIN_13|GPIO_PIN_14|GPIO_PIN_15;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
#endif
#endif

  /* EXTI interrupt init*/
  HAL_NVIC_SetPriority(EXTI15_10_IRQn, 5, 0);
  HAL_NVIC_EnableIRQ(EXTI15_10_IRQn);

}

/* USER CODE BEGIN 4 */
#if defined(MEAS_LATENCY) || defined(MEAS_INTERRUPT_LATENCY_TIME)
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
#if defined(MEAS_LATENCY)
	HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, HAL_GPIO_ReadPin(GPIOC, GPIO_Pin));
#elif defined(MEAS_INTERRUPT_LATENCY_TIME)
	if(GPIO_Pin == GPIO_PIN_13)
		osSemaphoreRelease(interruptLatency_xSemaphore);
#endif

}
#endif

#if defined(MEAS_TASK_SWITCHING_TIME)
void StartSwitchingTimeTaskA(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY/2;i++){}
		}
	}
}

void StartSwitchingTimeTaskB(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreC_xSemaphore);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY/2;i++){}
		}
	}
}

void StartSwitchingTimeTaskC(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreC_xSemaphore, portMAX_DELAY) == osOK)
		{
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY/2;i++){}
		}
	}
}
#endif

#if defined(MEAS_PREEMPTION_TIME)
void StartPreemptionTimeTaskA(void const * argument)
{
	int i = 0;
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			for(i=0;i<LOW_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartPreemptionTimeTaskB(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreC_xSemaphore);
			osDelay(11);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartPreemptionTimeTaskC(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreC_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(23);
			for(i=0;i<HIGH_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}
#endif

#if defined(MEAS_INTERRUPT_LATENCY_TIME)
void StartInterruptLatencyTimeTask(void const * argument)
{
	osSemaphoreDef(INTSEM);
	interruptLatency_xSemaphore = osSemaphoreCreate(osSemaphore(INTSEM), 1);

	while(1)
	{
		if(osSemaphoreWait(interruptLatency_xSemaphore, portMAX_DELAY) == osOK)
		{
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0810								\n"/* GPIOC címének betöltése */
			"	movt r0, #0x4002								\n"
			"   ldr r1, [r0, #0]								\n"/* PORTC értékének betöltése */
			" 	lsr r1, r1, #10									\n"/* Bit helyre mozgatása */
			" 	and r1, r1, #0x00000008							\n"/* Maszkolások */
			"   movw r0, #0x0C14								\n"/* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2, [r0, #0]								\n"
			" 	and r2, r2, #0xFFFFFFF7							\n"
			" 	orr r2, r2, r1									\n"
			" 	str r2, [r0, #0]								\n"/* Érték kihelyezése a lábra */
			"	pop {r0, r1, r2}								\n"
			);
		}
	}
}
#endif

#if defined(MEAS_SEMAPHORE_SHUFFLING_TIME)
void StartSemaphoreShufflingTimeTaskA(void const * argument)
{
	int i = 0;

