Lyque/diplomaterv/Projects/TrueSTUDIO/STM32F4_CubeMX_FreeRTOS/Src/main.c
	osSemaphoreDef(SEMSHUFSEM);
	semaphoreShuffling_xSemaphore = osSemaphoreCreate(osSemaphore(SEMSHUFSEM), 1);

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			if(osSemaphoreWait(semaphoreShuffling_xSemaphore, portMAX_DELAY) == osOK)
			{
				for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
				osSemaphoreRelease(semaphoreShuffling_xSemaphore);
			}
		}
	}
}

void StartSemaphoreShufflingTimeTaskB(void const * argument)
{
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(10);
			if(osSemaphoreWait(semaphoreShuffling_xSemaphore, portMAX_DELAY) == osOK)
			{
				osSemaphoreRelease(semaphoreShuffling_xSemaphore);
			}
		}
	}
}
#endif

#if defined(MEAS_DEADLOCK_BREAKING_TIME)
void StartDeadlockBreakingTimeTaskA(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreB_xSemaphore);
			if(osMutexWait(deadlockBreaking_xMutex, portMAX_DELAY) == osOK)
			{
				for(i=0;i<LOW_PRIORITY_TASK_LOOP_DELAY;i++){}
				osMutexRelease(deadlockBreaking_xMutex);
			}
		}
	}
}

void StartDeadlockBreakingTimeTaskB(void const * argument)
{
	int i = 0;

	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			osSemaphoreRelease(measureSemaphoreC_xSemaphore);
			osDelay(11);
			for(i=0;i<MEDIUM_PRIORITY_TASK_LOOP_DELAY;i++){}
		}
	}
}

void StartDeadlockBreakingTimeTaskC(void const * argument)
{
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreC_xSemaphore, portMAX_DELAY) == osOK)
		{
			osDelay(23);
			if(osMutexWait(deadlockBreaking_xMutex, portMAX_DELAY) == osOK)
			{
				osMutexRelease(deadlockBreaking_xMutex);
			}
		}
	}
}
#endif

#if defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
void StartDatagramThroughputTimeTaskA(void const * argument)
{
	osSemaphoreDef(DATAGRAMSEM);
	datagramThroughput_xSemaphore = osSemaphoreCreate(osSemaphore(DATAGRAMSEM), 1);
	osMessageQDef(DATAGRAMMES, 128, uint32_t);
	datagramThrougput_xMessage = osMessageCreate(osMessageQ(DATAGRAMMES), NULL);

	uint32_t i = 0;
	uint32_t temp;
	osEvent event;

	while(1)
	{
		if(osSemaphoreWait(datagramThroughput_xSemaphore, portMAX_DELAY) == osOK)
		{
			if(osSemaphoreWait(measureSemaphoreA_xSemaphore, portMAX_DELAY) == osOK)
			{
				osSemaphoreRelease(measureSemaphoreB_xSemaphore);
				for(i=0;i<128;i++)
				{
					event = osMessageGet(datagramThrougput_xMessage, portMAX_DELAY);
					if(event.status == osEventMessage)
					{
						temp = (uint32_t)event.value.p;
						if(temp != i)
							return;
						// Láb állítása
					}
				}
				osSemaphoreRelease(datagramThroughput_xSemaphore);
				portYIELD();
			}
		}
	}
}

void StartDatagramThroughputTimeTaskB(void const * argument)
{
	uint32_t i = 0;
	while(1)
	{
		if(osSemaphoreWait(measureSemaphoreB_xSemaphore, portMAX_DELAY) == osOK)
		{
			// OUT láb magasba állítása
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0C14								\n" /* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2,[r0, #0]									\n"
			" 	orr r2, r2, #0x00000008							\n"
			" 	str r2, [r0, #0]								\n" /* Null értékek kiírása a lábakra */
			"	pop {r0, r1, r2}								\n"
			);
			for(i=0;i<128;i++)
			{
				osMessagePut(datagramThrougput_xMessage, i, portMAX_DELAY);
			}
			if(osSemaphoreWait(datagramThroughput_xSemaphore, portMAX_DELAY) == osOK)
				osSemaphoreRelease(datagramThroughput_xSemaphore);
			// OUT láb alacsonyba állítása
			__asm volatile
			(
			"	push {r0, r1, r2}								\n"
			"   movw r0, #0x0C14								\n" /* GPIOD címének betöltése */
			"	movt r0, #0x4002								\n"
			" 	ldr r2,[r0, #0]									\n"
			" 	and r2, r2, #0xFFFFFFF7							\n"
			" 	str r2, [r0, #0]								\n" /* Null értékek kiírása a lábakra */
			"	pop {r0, r1, r2}								\n"
			);
		}
	}
}

#endif

#if defined(BLINKING_LED)
void StartForwardLEDTask(void const * argument)
{
	while(1)
	  {
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
		osDelay(400);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		osDelay(500);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		osDelay(600);
	  }
}

void StartReverseLEDTask(void const * argument)
{
	while(1)
	  {
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		osDelay(100);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_13);
		osDelay(200);
		HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_12);
		osDelay(300);
	  }
}
#endif

#if defined(MEAS_W_LOAD)
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *UartHandle)
{
	if (UartHandle->Instance == USART6)
		osSemaphoreRelease(uart6_xSemaphore);
}

void StartUART6Task(void const * argument)
{
	uint8_t data[1];
	uint16_t size = sizeof(data)/sizeof(uint8_t);

	osSemaphoreDef(SEM);
	uart6_xSemaphore = osSemaphoreCreate(osSemaphore(SEM), 1);

	osSemaphoreWait(uart6_xSemaphore, 0);
	while(1)
	{
		HAL_UART_Receive_IT(&huart6, data, size);
		if(osSemaphoreWait(uart6_xSemaphore, portMAX_DELAY) == osOK)
		{
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_15);
			HAL_UART_Transmit(&huart6, data, size, 100);
		}
		else
		{
			HAL_GPIO_TogglePin(GPIOD, GPIO_PIN_14);
		}
	}
}
#endif
/* USER CODE END 4 */

/* StartStartMeasureTask function */
void StartStartMeasureTask(void const * argument)
{
  /* init code for FATFS */
#if defined(MEAS_W_LOAD)
  MX_FATFS_Init();
#endif

  /* USER CODE BEGIN 5 */

  /* Infinite loop */
  while(1)
  {
#if defined(MEAS_TASK_SWITCHING_TIME) || defined(MEAS_PREEMPTION_TIME) || defined(MEAS_SEMAPHORE_SHUFFLING_TIME) || defined(MEAS_DEADLOCK_BREAKING_TIME) || defined(MEAS_DATAGRAM_THROUGHPUT_TIME)
	  osSemaphoreRelease(measureSemaphoreA_xSemaphore);
#endif

    osDelay(100);
  }
  /* USER CODE END 5 */ 
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
/* USER CODE BEGIN Callback 0 */

/* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
/* USER CODE BEGIN Callback 1 */

/* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
